wujc106/gd32g553r/Firmware/CMSIS/GD/GD32G5x3/Source/system_gd32g5x3.c
/*!
    \file  system_gd32g5x3.c
    \brief CMSIS Cortex-M33 Device Peripheral Access Layer Source File for
           GD32G5x3 Device Series
*/

/*
 * Copyright (c) 2009-2018 Arm Limited. All rights reserved.
 * Copyright (c) 2026, GigaDevice Semiconductor Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/* This file refers the CMSIS standard, some adjustments are made according to GigaDevice chips */

#include "gd32g5x3.h"

/* system frequency define */
#define __IRC8M           (IRC8M_VALUE)            /* internal 8 MHz RC oscillator frequency */
#define __HXTAL           (HXTAL_VALUE)            /* high speed crystal oscillator frequency */
#define __SYS_OSC_CLK     (__IRC8M)                /* main oscillator frequency */

#define VECT_TAB_OFFSET  (uint32_t)0x00            /* vector table base offset */

/* select a system clock by uncommenting the following line */
#if !(defined(GD32G553XXX3) || defined(GD32G533XXX3))
//#define __SYSTEM_CLOCK_IRC8M                    (uint32_t)(__IRC8M)
//#define __SYSTEM_CLOCK_48M_PLL_IRC8M           (uint32_t)(48000000)
//#define __SYSTEM_CLOCK_96M_PLL_IRC8M           (uint32_t)(96000000)
//#define __SYSTEM_CLOCK_120M_PLL_IRC8M           (uint32_t)(120000000)
//#define __SYSTEM_CLOCK_170M_PLL_IRC8M           (uint32_t)(170000000)
//#define __SYSTEM_CLOCK_216M_PLL_IRC8M           (uint32_t)(216000000)
#else
//#define __SYSTEM_CLOCK_IRC8M                    (uint32_t)(__IRC8M)
//#define __SYSTEM_CLOCK_48M_PLL_IRC8M           (uint32_t)(48000000)
//#define __SYSTEM_CLOCK_96M_PLL_IRC8M           (uint32_t)(96000000)
//#define __SYSTEM_CLOCK_120M_PLL_IRC8M           (uint32_t)(120000000)
//#define __SYSTEM_CLOCK_170M_PLL_IRC8M           (uint32_t)(170000000)
#endif

/* use HXTAL = 8M */
#if !(defined(GD32G553XXX3) || defined(GD32G533XXX3))
//#define __SYSTEM_CLOCK_HXTAL                    (uint32_t)(__HXTAL)
//#define __SYSTEM_CLOCK_48M_PLL_HXTAL            (uint32_t)(48000000)
//#define __SYSTEM_CLOCK_96M_PLL_HXTAL            (uint32_t)(96000000)
//#define __SYSTEM_CLOCK_120M_PLL_HXTAL           (uint32_t)(120000000)
//#define __SYSTEM_CLOCK_170M_PLL_HXTAL           (uint32_t)(170000000)
#define __SYSTEM_CLOCK_216M_PLL_HXTAL           (uint32_t)(216000000)
#else
//#define __SYSTEM_CLOCK_HXTAL                    (uint32_t)(__HXTAL)
//#define __SYSTEM_CLOCK_48M_PLL_HXTAL            (uint32_t)(48000000)
//#define __SYSTEM_CLOCK_96M_PLL_HXTAL            (uint32_t)(96000000)
//#define __SYSTEM_CLOCK_120M_PLL_HXTAL           (uint32_t)(120000000)
#define __SYSTEM_CLOCK_170M_PLL_HXTAL           (uint32_t)(170000000)
#endif

/* The following is to prevent Vcore fluctuations caused by frequency switching. 
   It is strongly recommended to include it to avoid issues caused by self-removal. */
#define RCU_MODIFY_DE_2(__delay)  do{                                                 \
                                      volatile uint32_t i;                            \
                                      volatile uint32_t reg;                          \
                                      const uint32_t delay_val = (uint32_t)(__delay); \
                                      if(0U != delay_val){                            \
                                          /* Insert a software delay */               \
                                          for(i=0U; i<delay_val; i++){                \
                                          }                                           \
                                          reg = RCU_CFG0;                             \
                                          reg &= ~(RCU_CFG0_AHBPSC);                  \
                                          reg |= RCU_AHB_CKSYS_DIV2;                  \
                                          /* AHB = SYSCLK/2 */                        \
                                          RCU_CFG0 = reg;                             \
                                          /* Insert a software delay */               \
                                          for(i=0U; i<delay_val; i++){                \
                                          }                                           \
                                          reg = RCU_CFG0;                             \
                                          reg &= ~(RCU_CFG0_AHBPSC);                  \
                                          reg |= RCU_AHB_CKSYS_DIV4;                  \
                                          /* AHB = SYSCLK/4 */                        \
                                          RCU_CFG0 = reg;                             \
                                          /* Insert a software delay */               \
                                          for(i=0U; i<delay_val; i++){                \
                                          }                                           \
                                      }                                               \
                                  }while(0)

    
#define SEL_IRC8M           0x00U
#define SEL_HXTAL           0x01U
#define SEL_PLLP            0x03U

#define PLLPSC_REG_OFFSET   0U
#define PLLN_REG_OFFSET     6U
#define PLLP_REG_OFFSET     16U
#define PLLQ_REG_OFFSET     23U
#define PLLR_REG_OFFSET     27U

/* set the system clock frequency and declare the system clock configuration function */
#ifdef __SYSTEM_CLOCK_IRC8M
uint32_t SystemCoreClock = __SYSTEM_CLOCK_IRC8M;
static void system_clock_8m_irc8m(void);
#elif defined (__SYSTEM_CLOCK_48M_PLL_IRC8M)
#define PLLPSC              (2U - 1U)
#define PLLN                (24U)
#define PLLP                ((2U >> 1U) - 1U)
#define PLLQ                (2U)
#define PLLR                (2U)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_48M_PLL_IRC8M;
static void system_clock_48m_irc8m(void);
#elif defined (__SYSTEM_CLOCK_96M_PLL_IRC8M)
#define PLLPSC              (2U - 1U)
#define PLLN                (48U)
#define PLLP                ((2U >> 1U) - 1U)
#define PLLQ                (2U)
#define PLLR                (2U)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_96M_PLL_IRC8M;
static void system_clock_96m_irc8m(void);
#elif defined (__SYSTEM_CLOCK_120M_PLL_IRC8M)
#define PLLPSC              (2U - 1U)
#define PLLN                (60U)
#define PLLP                ((2U >> 1U) - 1U)
#define PLLQ                (2U)
#define PLLR                (2U)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_120M_PLL_IRC8M;
static void system_clock_120m_irc8m(void);
#elif defined (__SYSTEM_CLOCK_170M_PLL_IRC8M)
#define PLLPSC              (2U - 1U)
#define PLLN                (85U)
#define PLLP                ((2U >> 1U) - 1U)
#define PLLQ                (2U)
#define PLLR                (2U)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_170M_PLL_IRC8M;
static void system_clock_170m_irc8m(void);
#elif defined (__SYSTEM_CLOCK_216M_PLL_IRC8M)
#define PLLPSC              (2U - 1U)
#define PLLN                (108U)
#define PLLP                ((2U >> 1U) - 1U)
#define PLLQ                (2U)
#define PLLR                (2U)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_216M_PLL_IRC8M;
static void system_clock_216m_irc8m(void);
#elif defined (__SYSTEM_CLOCK_HXTAL)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_HXTAL;
static void system_clock_hxtal(void);
#elif defined (__SYSTEM_CLOCK_48M_PLL_HXTAL)
#define PLLPSC              (2U - 1U)
#define PLLN                (24U)
#define PLLP                ((2U >> 1U) - 1U)
#define PLLQ                (2U)
#define PLLR                (2U)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_48M_PLL_HXTAL;
static void system_clock_48m_hxtal(void);
#elif defined (__SYSTEM_CLOCK_96M_PLL_HXTAL)
#define PLLPSC              (2U - 1U)
#define PLLN                (48U)
#define PLLP                ((2U >> 1U) - 1U)
#define PLLQ                (2U)
#define PLLR                (2U)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_96M_PLL_HXTAL;
static void system_clock_96m_hxtal(void);
#elif defined (__SYSTEM_CLOCK_120M_PLL_HXTAL)
#define PLLPSC              (2U - 1U)
#define PLLN                (60U)
#define PLLP                ((2U >> 1U) - 1U)
#define PLLQ                (2U)
#define PLLR                (2U)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_120M_PLL_HXTAL;
static void system_clock_120m_hxtal(void);
#elif defined (__SYSTEM_CLOCK_170M_PLL_HXTAL)
#define PLLPSC              (2U - 1U)
#define PLLN                (85U)
#define PLLP                ((2U >> 1U) - 1U)
#define PLLQ                (2U)
#define PLLR                (2U)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_170M_PLL_HXTAL;
static void system_clock_170m_hxtal(void);
#elif defined (__SYSTEM_CLOCK_216M_PLL_HXTAL)
#define PLLPSC              (2U - 1U)
#define PLLN                (108U)
#define PLLP                ((2U >> 1U) - 1U)
#define PLLQ                (2U)
#define PLLR                (2U)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_216M_PLL_HXTAL;
static void system_clock_216m_hxtal(void);
#endif /* __SYSTEM_CLOCK_IRC8M */

/* configure the system clock */
static void system_clock_config(void);
static void _soft_delay_(uint32_t time);
/* software delay to prevent the impact of Vcore fluctuations.
   It is strongly recommended to include it to avoid issues caused by self-removal. */
static void _soft_delay_(uint32_t time)
{
    __IO uint32_t i;
    for(i=0U; i<time*10U; i++){
    }
}

/*!
    \brief      setup the micro-controller system, initialize the system
    \param[in]  none
    \param[out] none
    \retval     none
*/
void SystemInit (void)
{
  /* FPU settings */
#if (__FPU_PRESENT == 1) && (__FPU_USED == 1U)
    SCB->CPACR |= ((3UL << 10*2)|(3UL << 11*2));  /* set CP10 and CP11 Full Access */
#endif
    /* reset the RCU clock configuration to the default reset state */
    /* Set IRC8MEN bit */
    RCU_CTL |= RCU_CTL_IRC8MEN;
    while(0U == (RCU_CTL & RCU_CTL_IRC8MSTB)){
    }
    if(((RCU_CFG0 & RCU_CFG0_SCSS) == RCU_SCSS_PLLP)){
        RCU_MODIFY_DE_2(0x50);
    }
    RCU_CFG0 &= ~RCU_CFG0_SCS;
    _soft_delay_(200U);
    /* reset HXTALEN, CKMEN and PLLEN bits */
    RCU_CTL &= ~(RCU_CTL_PLLEN | RCU_CTL_CKMEN | RCU_CTL_HXTALEN);
    /* disable all interrupts */
    RCU_INT = 0x109f0000U;

